000100171215     A          R ALLSHIFT                  PFILE(SENECAPAY/ALLSHIFT)
000101171215     A          K EMPNUM
000102171215     A          S WORKSHIFT                 COMP(EQ 'A')
000103171215
000104171215
