000100171124     A          R ALLSHIFT                  PFILE(SENECAPAY/ALLSHIFT)
000101171124     A          K EMPNUM
000102171124     A          S WORKSHIFT                 COMP(EQ 'N')
000103171124
000104171124
